Tekla Open API Reference for Tekla Structures 2025
Double Properties
The Double type exposes the following members.
Properties
Name | Description
Value
 The value of the double datatype.
Top
See Also
Reference
Double Structure
Tekla.Structures.Datatype Namespace